In [1]:
import json

import nltk
import numpy as np
import pandas as pd
import tensorflow as tf
import tensorflow_hub as hub
import tensorflow_text as text

2023-05-07 22:03:11.200513: I tensorflow/tsl/cuda/cudart_stub.cc:28] Could not find cuda drivers on your machine, GPU will not be used.
2023-05-07 22:03:11.397545: I tensorflow/tsl/cuda/cudart_stub.cc:28] Could not find cuda drivers on your machine, GPU will not be used.
2023-05-07 22:03:11.398839: I tensorflow/core/platform/cpu_feature_guard.cc:182] This TensorFlow binary is optimized to use available CPU instructions in performance-critical operations.
To enable the following instructions: AVX2 FMA, in other operations, rebuild TensorFlow with the appropriate compiler flags.
2023-05-07 22:03:12.153222: W tensorflow/compiler/tf2tensorrt/utils/py_utils.cc:38] TF-TRT Warning: Could not find TensorRT

In [2]:
class schema:
    def __init__ (self, id):
        self.id = id
        self.tableNames = []

# Data Analysis and Preprocessing

We note that the databases with the largest amounts of queries in Spider are college_2/college_1, hr_1, store_1, and soccer_2.
We will create 4 models applied on each of these databases.

In [3]:
# Loading Spider Data
with open('./spider-data/tables.json', 'r') as f:
  schemaDoc = json.load(f)

with open('./spider-data/train_spider.json', 'r') as f:
  queryDoc = json.load(f)

schemas = {}
db_counts = {}

for idx, iquery in enumerate(queryDoc):
    db_counts[iquery['db_id']] = db_counts.get(iquery['db_id'], 0) + 1

print(sorted(db_counts.items(), key=lambda x:x[1], reverse=True))

[('college_2', 170), ('college_1', 164), ('hr_1', 124), ('store_1', 112), ('soccer_2', 106), ('bike_1', 104), ('music_1', 100), ('hospital_1', 100), ('music_2', 100), ('dorm_1', 100), ('allergy_1', 98), ('movie_1', 98), ('flight_1', 96), ('driving_school', 93), ('cre_Doc_Tracking_DB', 90), ('department_store', 88), ('customers_and_addresses', 88), ('activity_1', 88), ('network_2', 86), ('products_gen_characteristics', 86), ('game_1', 86), ('chinook_1', 84), ('cre_Theme_park', 84), ('cre_Docs_and_Epenses', 84), ('customers_and_invoices', 82), ('sakila_1', 82), ('baseball_1', 82), ('e_learning', 82), ('cre_Drama_Workshop_Groups', 82), ('wine_1', 82), ('flight_4', 82), ('customers_card_transactions', 80), ('apartment_rentals', 80), ('formula_1', 80), ('loan_1', 80), ('manufactory_1', 80), ('tracking_grants_for_research', 78), ('inn_1', 74), ('college_3', 74), ('voter_2', 72), ('csu_1', 70), ('club_1', 70), ('election', 68), ('student_1', 68), ('icfp_1', 66), ('music_4', 60), ('tracking_orders', 60), ('match_season', 58), ('student_assessment', 53), ('sports_competition', 52), ('small_bank_1', 50), ('insurance_policies', 48), ('film_rank', 48), ('tracking_software_problems', 48), ('ship_1', 48), ('scientist_1', 48), ('university_basketball', 46), ('gas_company', 46), ('aircraft', 46), ('customer_complaints', 46), ('medicine_enzyme_interaction', 44), ('party_people', 44), ('storm_record', 44), ('document_management', 44), ('store_product', 44), ('shop_membership', 44), ('product_catalog', 42), ('race_track', 42), ('insurance_fnol', 42), ('tracking_share_transactions', 41), ('farm', 40), ('musical', 40), ('climbing', 40), ('insurance_and_eClaims', 40), ('theme_gallery', 40), ('gymnast', 40), ('wrestler', 40), ('entrepreneur', 40), ('candidate_poll', 40), ('county_public_safety', 40), ('behavior_monitoring', 40), ('program_share', 40), ('company_office', 40), ('school_player', 40), ('device', 40), ('city_record', 40), ('e_government', 40), ('culture_company', 38), ('cre_Doc_Control_Systems', 33), ('assets_maintenance', 31), ('epinions_1', 30), ('cinema', 30), ('machine_repair', 30), ('party_host', 30), ('ship_mission', 30), ('swimming', 30), ('workshop_paper', 30), ('phone_1', 29), ('twitter_1', 27), ('school_finance', 26), ('body_builder', 24), ('train_station', 23), ('restaurant_1', 22), ('entertainment_awards', 22), ('book_2', 21), ('perpetrator', 21), ('railway', 21), ('election_representative', 20), ('wedding', 20), ('protein_institute', 20), ('game_injury', 19), ('flight_company', 19), ('journal_committee', 18), ('coffee_shop', 18), ('browser_web', 18), ('products_for_hire', 18), ('news_report', 18), ('school_bus', 18), ('riding_club', 17), ('mountain_photos', 17), ('local_govt_and_lot', 17), ('roller_coaster', 17), ('architecture', 17), ('department_management', 16), ('customer_deliveries', 16), ('station_weather', 16), ('manufacturer', 16), ('company_employee', 16), ('performance_attendance', 15), ('debate', 15), ('phone_market', 15), ('pilot_record', 15), ('local_govt_in_alabama', 15), ('decoration_competition', 15), ('solvency_ii', 15), ('customers_campaigns_ecommerce', 15), ('customers_and_products_contacts', 15), ('soccer_1', 14), ('local_govt_mdm', 14), ('company_1', 7)]

### Filter Queries

We now filter the query and schema doc entries to the queries linked to the four databases we're creating models for (college_2, hr_1, store_1, and soccer_2)

In [8]:
filteredQueryDoc = [query for query in queryDoc if query['db_id'] in ['college_2','hr_1','store_1','soccer_2']]
filteredSchemaDoc = [schema for schema in schemaDoc if schema['db_id'] in ['college_2','hr_1','store_1','soccer_2']]

### Create outputs

Now we create our outputs (y) for the model. The outputs are in the following format:

e.g. `[0,0,0,1,0,1,1,...]`

Where the *nth* index corresponds to the *nth* table in the schema. The value contains a 1 if the table is referenced in the SQL query, and a 0 if it is not.

In [9]:
for idx, iSchema in enumerate(filteredSchemaDoc):
    dbid = iSchema['db_id']
    test = schema(dbid)
    for columnName in iSchema['table_names_original']:
        test.tableNames.append(columnName)
    print("Schema", idx, ":", test.id, ":", test.tableNames)
    schemas[dbid] = test

tables = []
nl_queries = []

for idx, iquery in enumerate(filteredQueryDoc):
   # Initialize a blank array with the length of the number of tables
   tablesArray = [0] * len(schemas[iquery['db_id']].tableNames)
   # Get all the tokens from teh particular query we are looking at
   queryTokens = iquery['query_toks']

   # Search through all the tokens in the given query
   for idx, queryToken in enumerate(queryTokens):
      # Only look at tokens that come after the word "from," since those are the table names
      if (idx > 0) & (queryTokens[idx - 1].lower() == "from") | (queryTokens[idx - 1].lower() == "join"):
        # Search through all of the table names in the database we are looking at

        # TODO: Use spacy to tag all table names using named entity recognition (NER).
        for jdx, tableName in enumerate(schemas[iquery['db_id']].tableNames):
           # If the table names match, indicate it in tablesArray
           if tableName.lower() == queryToken.lower():
              tablesArray[jdx] = 1
   
   tables.append(tablesArray)
   print(tablesArray)
   #print(schemas[iquery['db_id']].id)
   print(iquery['query_toks'])

Schema 0 : college_2 : ['classroom', 'department', 'course', 'instructor', 'section', 'teaches', 'student', 'takes', 'advisor', 'time_slot', 'prereq']
Schema 1 : hr_1 : ['regions', 'countries', 'departments', 'jobs', 'employees', 'job_history', 'locations']
Schema 2 : store_1 : ['artists', 'sqlite_sequence', 'albums', 'employees', 'customers', 'genres', 'invoices', 'media_types', 'tracks', 'invoice_lines', 'playlists', 'playlist_tracks']
Schema 3 : soccer_2 : ['College', 'Player', 'Tryout']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_country', ',', 'COUNT', '(', '*', ')', 'FROM', 'invoices', 'GROUP', 'BY', 'billing_country', 'ORDER', 'BY', 'count', '(', '*', ')', 'DESC', 'LIMIT', '5', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_country', ',', 'COUNT', '(', '*', ')', 'FROM', 'invoices', 'GROUP', 'BY', 'billing_country', 'ORDER', 'BY', 'count', '(', '*', ')', 'DESC', 'LIMIT', '5', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_country', ',', 'SUM', '(', 'total', ')', 'FROM', 'invoices', 'GROUP', 'BY', 'billing_country', 'ORDER', 'BY', 'SUM', '(', 'total', ')', 'DESC', 'LIMIT', '8', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_country', ',', 'SUM', '(', 'total', ')', 'FROM', 'invoices', 'GROUP', 'BY', 'billing_country', 'ORDER', 'BY', 'SUM', '(', 'total', ')', 'DESC', 'LIMIT', '8', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_country', ',', 'AVG', '(', 'total', ')', 'FROM', 'invoices', 'GROUP', 'BY', 'billing_country', 'ORDER', 'BY', 'AVG', '(', 'total', ')', 'DESC', 'LIMIT', '10', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_country', ',', 'AVG', '(', 'total', ')', 'FROM', 'invoices', 'GROUP', 'BY', 'billing_country', 'ORDER', 'BY', 'AVG', '(', 'total', ')', 'DESC', 'LIMIT', '10', ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T2.customer_id', '=', 'T1.id', 'ORDER', 'BY', 'T2.invoice_date', 'DESC', 'LIMIT', '5', ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T2.customer_id', '=', 'T1.id', 'ORDER', 'BY', 'T2.invoice_date', 'DESC', 'LIMIT', '5', ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', ',', 'COUNT', '(', '*', ')', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T2.customer_id', '=', 'T1.id', 'GROUP', 'BY', 'T1.id', 'ORDER', 'BY', 'COUNT', '(', '*', ')', 'DESC', 'LIMIT', '10', ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', ',', 'COUNT', '(', '*', ')', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T2.customer_id', '=', 'T1.id', 'GROUP', 'BY', 'T1.id', 'ORDER', 'BY', 'COUNT', '(', '*', ')', 'DESC', 'LIMIT', '10', ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', ',', 'SUM', '(', 'T2.total', ')', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T2.customer_id', '=', 'T1.id', 'GROUP', 'BY', 'T1.id', 'ORDER', 'BY', 'SUM', '(', 'T2.total', ')', 'DESC', 'LIMIT', '10', ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', ',', 'SUM', '(', 'T2.total', ')', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T2.customer_id', '=', 'T1.id', 'GROUP', 'BY', 'T1.id', 'ORDER', 'BY', 'SUM', '(', 'T2.total', ')', 'DESC', 'LIMIT', '10', ';']
[0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0]
['SELECT', 'T1.name', ',', 'COUNT', '(', '*', ')', 'FROM', 'genres', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T2.genre_id', '=', 'T1.id', 'GROUP', 'BY', 'T1.id', 'ORDER', 'BY', 'count', '(', '*', ')', 'DESC', 'LIMIT', '5', ';']
[0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0]
['SELECT', 'T1.name', ',', 'COUNT', '(', '*', ')', 'FROM', 'genres', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T2.genre_id', '=', 'T1.id', 'GROUP', 'BY', 'T1.id', 'ORDER', 'BY', 'count', '(', '*', ')', 'DESC', 'LIMIT', '5', ';']
[0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'title', 'FROM', 'albums', ';']
[0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'title', 'FROM', 'albums', ';']
[0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'title', 'FROM', 'albums', 'ORDER', 'BY', 'title', ';']
[0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'title', 'FROM', 'albums', 'ORDER', 'BY', 'title', ';']
[0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'title', 'FROM', 'albums', 'WHERE', 'title', 'LIKE', "'A", '%', "'", 'ORDER', 'BY', 'title', ';']
[0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'title', 'FROM', 'albums', 'WHERE', 'title', 'LIKE', "'A", '%', "'", 'ORDER', 'BY', 'title', ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T2.customer_id', '=', 'T1.id', 'ORDER', 'BY', 'total', 'LIMIT', '10', ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T2.customer_id', '=', 'T1.id', 'ORDER', 'BY', 'total', 'LIMIT', '10', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'sum', '(', 'total', ')', 'FROM', 'invoices', 'WHERE', 'billing_city', '=', '``', 'Chicago', "''", 'AND', 'billing_state', '=', '``', 'IL', "''", ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'sum', '(', 'total', ')', 'FROM', 'invoices', 'WHERE', 'billing_city', '=', '``', 'Chicago', "''", 'AND', 'billing_state', '=', '``', 'IL', "''", ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'COUNT', '(', '*', ')', 'FROM', 'invoices', 'WHERE', 'billing_city', '=', '``', 'Chicago', "''", 'AND', 'billing_state', '=', '``', 'IL', "''", ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'COUNT', '(', '*', ')', 'FROM', 'invoices', 'WHERE', 'billing_city', '=', '``', 'Chicago', "''", 'AND', 'billing_state', '=', '``', 'IL', "''", ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_state', ',', 'COUNT', '(', '*', ')', 'FROM', 'invoices', 'WHERE', 'billing_country', '=', '``', 'USA', "''", 'GROUP', 'BY', 'billing_state', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_state', ',', 'COUNT', '(', '*', ')', 'FROM', 'invoices', 'WHERE', 'billing_country', '=', '``', 'USA', "''", 'GROUP', 'BY', 'billing_state', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_state', ',', 'COUNT', '(', '*', ')', 'FROM', 'invoices', 'WHERE', 'billing_country', '=', '``', 'USA', "''", 'GROUP', 'BY', 'billing_state', 'ORDER', 'BY', 'COUNT', '(', '*', ')', 'DESC', 'LIMIT', '1', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_state', ',', 'COUNT', '(', '*', ')', 'FROM', 'invoices', 'WHERE', 'billing_country', '=', '``', 'USA', "''", 'GROUP', 'BY', 'billing_state', 'ORDER', 'BY', 'COUNT', '(', '*', ')', 'DESC', 'LIMIT', '1', ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_state', ',', 'COUNT', '(', '*', ')', ',', 'SUM', '(', 'total', ')', 'FROM', 'invoices', 'WHERE', 'billing_state', '=', '``', 'CA', "''", ';']
[0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'billing_state', ',', 'COUNT', '(', '*', ')', ',', 'SUM', '(', 'total', ')', 'FROM', 'invoices', 'WHERE', 'billing_state', '=', '``', 'CA', "''", ';']
[1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T1.title', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'artists', 'AS', 'T2', 'ON', 'T1.artist_id', '=', 'T2.id', 'WHERE', 'T2.name', '=', '``', 'Aerosmith', "''", ';']
[1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T1.title', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'artists', 'AS', 'T2', 'ON', 'T1.artist_id', '=', 'T2.id', 'WHERE', 'T2.name', '=', '``', 'Aerosmith', "''", ';']
[1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'artists', 'AS', 'T2', 'ON', 'T1.artist_id', '=', 'T2.id', 'WHERE', 'T2.name', '=', '``', 'Billy', 'Cobham', "''", ';']
[1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'artists', 'AS', 'T2', 'ON', 'T1.artist_id', '=', 'T2.id', 'WHERE', 'T2.name', '=', '``', 'Billy', 'Cobham', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'company', 'FROM', 'customers', 'WHERE', 'first_name', '=', '``', 'Eduardo', "''", 'AND', 'last_name', '=', '``', 'Martins', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'company', 'FROM', 'customers', 'WHERE', 'first_name', '=', '``', 'Eduardo', "''", 'AND', 'last_name', '=', '``', 'Martins', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'email', ',', 'phone', 'FROM', 'customers', 'WHERE', 'first_name', '=', '``', 'Astrid', "''", 'AND', 'last_name', '=', '``', 'Gruber', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'email', ',', 'phone', 'FROM', 'customers', 'WHERE', 'first_name', '=', '``', 'Astrid', "''", 'AND', 'last_name', '=', '``', 'Gruber', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'customers', 'WHERE', 'city', '=', '``', 'Prague', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'customers', 'WHERE', 'city', '=', '``', 'Prague', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'customers', 'WHERE', 'state', '=', '``', 'CA', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'customers', 'WHERE', 'state', '=', '``', 'CA', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'country', 'FROM', 'customers', 'WHERE', 'first_name', '=', '``', 'Roberto', "''", 'AND', 'last_name', '=', '``', 'Almeida', "''", ';']
[0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'country', 'FROM', 'customers', 'WHERE', 'first_name', '=', '``', 'Roberto', "''", 'AND', 'last_name', '=', '``', 'Almeida', "''", ';']
[1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T2.title', 'FROM', 'artists', 'AS', 'T1', 'JOIN', 'albums', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.artist_id', 'WHERE', 'T1.name', 'LIKE', "'", '%', 'Led', '%', "'"]
[1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T2.title', 'FROM', 'artists', 'AS', 'T1', 'JOIN', 'albums', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.artist_id', 'WHERE', 'T1.name', 'LIKE', "'", '%', 'Led', '%', "'"]
[0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'employees', 'AS', 'T1', 'JOIN', 'customers', 'AS', 'T2', 'ON', 'T2.support_rep_id', '=', 'T1.id', 'WHERE', 'T1.first_name', '=', '``', 'Steve', "''", 'AND', 'T1.last_name', '=', '``', 'Johnson', "''", ';']
[0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'employees', 'AS', 'T1', 'JOIN', 'customers', 'AS', 'T2', 'ON', 'T2.support_rep_id', '=', 'T1.id', 'WHERE', 'T1.first_name', '=', '``', 'Steve', "''", 'AND', 'T1.last_name', '=', '``', 'Johnson', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'title', ',', 'phone', ',', 'hire_date', 'FROM', 'employees', 'WHERE', 'first_name', '=', '``', 'Nancy', "''", 'AND', 'last_name', '=', '``', 'Edwards', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'title', ',', 'phone', ',', 'hire_date', 'FROM', 'employees', 'WHERE', 'first_name', '=', '``', 'Nancy', "''", 'AND', 'last_name', '=', '``', 'Edwards', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T2.first_name', ',', 'T2.last_name', 'FROM', 'employees', 'AS', 'T1', 'JOIN', 'employees', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.reports_to', 'WHERE', 'T1.first_name', '=', '``', 'Nancy', "''", 'AND', 'T1.last_name', '=', '``', 'Edwards', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T2.first_name', ',', 'T2.last_name', 'FROM', 'employees', 'AS', 'T1', 'JOIN', 'employees', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.reports_to', 'WHERE', 'T1.first_name', '=', '``', 'Nancy', "''", 'AND', 'T1.last_name', '=', '``', 'Edwards', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'address', 'FROM', 'employees', 'WHERE', 'first_name', '=', '``', 'Nancy', "''", 'AND', 'last_name', '=', '``', 'Edwards', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'address', 'FROM', 'employees', 'WHERE', 'first_name', '=', '``', 'Nancy', "''", 'AND', 'last_name', '=', '``', 'Edwards', "''", ';']
[0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', 'FROM', 'employees', 'AS', 'T1', 'JOIN', 'customers', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.support_rep_id', 'GROUP', 'BY', 'T1.id', 'ORDER', 'BY', 'count', '(', '*', ')', 'DESC', 'LIMIT', '1']
[0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T1.first_name', ',', 'T1.last_name', 'FROM', 'employees', 'AS', 'T1', 'JOIN', 'customers', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.support_rep_id', 'GROUP', 'BY', 'T1.id', 'ORDER', 'BY', 'count', '(', '*', ')', 'DESC', 'LIMIT', '1']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'employees', 'WHERE', 'country', '=', '``', 'Canada', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'employees', 'WHERE', 'country', '=', '``', 'Canada', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'phone', 'FROM', 'employees', 'WHERE', 'first_name', '=', '``', 'Nancy', "''", 'AND', 'last_name', '=', '``', 'Edwards', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'phone', 'FROM', 'employees', 'WHERE', 'first_name', '=', '``', 'Nancy', "''", 'AND', 'last_name', '=', '``', 'Edwards', "''", ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'first_name', ',', 'last_name', 'FROM', 'employees', 'ORDER', 'BY', 'birth_date', 'DESC', 'LIMIT', '1', ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'first_name', ',', 'last_name', 'FROM', 'employees', 'ORDER', 'BY', 'birth_date', 'DESC', 'LIMIT', '1', ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'first_name', ',', 'last_name', 'FROM', 'employees', 'ORDER', 'BY', 'hire_date', 'ASC', 'LIMIT', '10', ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'first_name', ',', 'last_name', 'FROM', 'employees', 'ORDER', 'BY', 'hire_date', 'ASC', 'LIMIT', '10', ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', ',', 'city', 'FROM', 'employees', 'WHERE', 'title', '=', "'IT", 'Staff', "'", 'GROUP', 'BY', 'city']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', ',', 'city', 'FROM', 'employees', 'WHERE', 'title', '=', "'IT", 'Staff', "'", 'GROUP', 'BY', 'city']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T2.first_name', ',', 'T2.last_name', ',', 'count', '(', 'T1.reports_to', ')', 'FROM', 'employees', 'AS', 'T1', 'JOIN', 'employees', 'AS', 'T2', 'ON', 'T1.reports_to', '=', 'T2.id', 'GROUP', 'BY', 'T1.reports_to', 'ORDER', 'BY', 'count', '(', 'T1.reports_to', ')', 'DESC', 'LIMIT', '1', ';']
[0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0]
['SELECT', 'T2.first_name', ',', 'T2.last_name', ',', 'count', '(', 'T1.reports_to', ')', 'FROM', 'employees', 'AS', 'T1', 'JOIN', 'employees', 'AS', 'T2', 'ON', 'T1.reports_to', '=', 'T2.id', 'GROUP', 'BY', 'T1.reports_to', 'ORDER', 'BY', 'count', '(', 'T1.reports_to', ')', 'DESC', 'LIMIT', '1', ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.customer_id', 'WHERE', 'T1.first_name', '=', '``', 'Lucas', "''", 'AND', 'T1.last_name', '=', '``', 'Mancini', "''", ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'count', '(', '*', ')', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.customer_id', 'WHERE', 'T1.first_name', '=', '``', 'Lucas', "''", 'AND', 'T1.last_name', '=', '``', 'Mancini', "''", ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'sum', '(', 'T2.total', ')', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.customer_id', 'WHERE', 'T1.first_name', '=', '``', 'Lucas', "''", 'AND', 'T1.last_name', '=', '``', 'Mancini', "''", ';']
[0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0]
['SELECT', 'sum', '(', 'T2.total', ')', 'FROM', 'customers', 'AS', 'T1', 'JOIN', 'invoices', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.customer_id', 'WHERE', 'T1.first_name', '=', '``', 'Lucas', "''", 'AND', 'T1.last_name', '=', '``', 'Mancini', "''", ';']
[0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0]
['SELECT', 'name', 'FROM', 'media_types', ';']
[0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0]
['SELECT', 'name', 'FROM', 'media_types', ';']
[0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0]
['SELECT', 'DISTINCT', 'name', 'FROM', 'genres', ';']
[0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0]
['SELECT', 'DISTINCT', 'name', 'FROM', 'genres', ';']
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0]
['SELECT', 'name', 'FROM', 'playlists', ';']
[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0]
['SELECT', 'name', 'FROM', 'playlists', ';']
[0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'composer', 'FROM', 'tracks', 'WHERE', 'name', '=', '``', 'Fast', 'As', 'a', 'Shark', "''", ';']
[0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'composer', 'FROM', 'tracks', 'WHERE', 'name', '=', '``', 'Fast', 'As', 'a', 'Shark', "''", ';']
[0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'milliseconds', 'FROM', 'tracks', 'WHERE', 'name', '=', '``', 'Fast', 'As', 'a', 'Shark', "''", ';']
[0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'milliseconds', 'FROM', 'tracks', 'WHERE', 'name', '=', '``', 'Fast', 'As', 'a', 'Shark', "''", ';']
[0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0]
['SELECT', 'T2.name', 'FROM', 'genres', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.genre_id', 'WHERE', 'T1.name', '=', '``', 'Rock', "''", ';']
[0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0]
['SELECT', 'T2.name', 'FROM', 'genres', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.genre_id', 'WHERE', 'T1.name', '=', '``', 'Rock', "''", ';']
[0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'T1.title', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.genre_id', 'WHERE', 'T2.name', '=', '``', 'Balls', 'to', 'the', 'Wall', "''", ';']
[0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'T1.title', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.genre_id', 'WHERE', 'T2.name', '=', '``', 'Balls', 'to', 'the', 'Wall', "''", ';']
[0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'T2.name', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.genre_id', 'WHERE', 'T1.title', '=', '``', 'Balls', 'to', 'the', 'Wall', "''", ';']
[0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'T2.name', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.genre_id', 'WHERE', 'T1.title', '=', '``', 'Balls', 'to', 'the', 'Wall', "''", ';']
[0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'T1.title', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.album_id', 'GROUP', 'BY', 'T1.id', 'HAVING', 'count', '(', 'T1.id', ')', '>', '10', ';']
[0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0]
['SELECT', 'T1.title', 'FROM', 'albums', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.album_id', 'GROUP', 'BY', 'T1.id', 'HAVING', 'count', '(', 'T1.id', ')', '>', '10', ';']
[0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0]
['SELECT', 'T2.name', 'FROM', 'genres', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.genre_id', 'JOIN', 'media_types', 'AS', 'T3', 'ON', 'T3.id', '=', 'T2.media_type_id', 'WHERE', 'T1.name', '=', '``', 'Rock', "''", 'AND', 'T3.name', '=', '``', 'MPEG', 'audio', 'file', "''", ';']
[0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0]
['SELECT', 'T2.name', 'FROM', 'genres', 'AS', 'T1', 'JOIN', 'tracks', 'AS', 'T2', 'ON', 'T1.id', '=', 'T2.genre_id', 'JOIN', 'media_types', 'AS', 'T3', 'ON', 'T3.id', '=', 'T2.media_type_id', 'WHERE', 'T1.name', '=', '``', 'Rock', "''", 'AND', 'T3.name', '=', '``', 'MPEG', 'audio', 'file', "''", ';']
[0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0]

In [5]:
def loadTrainDF(inputLines):
    wordSense = 0
    questions = []
    tables = []

    for line in inputLines:
        if line == "1\n":
            wordSense = 1
        elif line == "2\n":
            wordSense = 2
        elif (line != "\n") & (wordSense != 0):
            lines.append(line.strip())
            senses.append(wordSense)
    trainDF = pd.DataFrame(data={'text': lines,'sense': senses})
    trainDF['classification'] = trainDF['sense'].apply(lambda x: x - 1)
    return trainDF

In [ ]:
def get_sentence_embeddings(bert_preprocess_model, bert_encoder_model, sentences = []):
    
    text_preprocessed = bert_preprocess_model(sentences)
    return bert_encoder_model(text_preprocessed)['pooled_output']

In [ ]:
# Code Adopted and modified from YouTube video: https://www.youtube.com/watch?v=7kLi8u2dJz0&t=719s
preprocess_url = 'https://tfhub.dev/tensorflow/bert_en_uncased_preprocess/3'
encoder_url = 'https://tfhub.dev/tensorflow/bert_en_uncased_L-12_H-768_A-12/4'

In [ ]:
bert_preprocess_model = hub.KerasLayer(preprocess_url)
bert_model = hub.KerasLayer(encoder_url)

In [ ]:
# ! Code Adopted and Modified from https://github.com/eclarson/MachineLearningNotebooks and https://www.youtube.com/watch?v=hOCDJyZ6quA
# Notebook 13: RNN Basics
from tensorflow.keras.layers import Dense, LSTM, Dropout, Input

# BERT Layers
text_input = tf.keras.layers.Input(shape=(), dtype=tf.string, name="text")
preprocessed_text = bert_preprocess_model(text_input)
outputs = bert_model(preprocessed_text)

# NN Layers
l = tf.keras.layers.Dropout(0.2, name="dropout")(outputs['pooled_output'])
l = tf.keras.layers.Dense(1, activation='sigmoid', name='output')(l)

# Final Model
model = tf.keras.Model(inputs=[text_input], outputs=[l])

METRICS = [
    tf.keras.metrics.BinaryAccuracy(name='accuracy'),
    tf.keras.metrics.Precision(name='precision'),
    tf.keras.metrics.Recall(name='recall')
]

model.compile(optimizer='adam', loss='binary_crossentropy', metrics=METRICS)

In [ ]:
model.fit(X_train, y_train, epochs=3)
model.save('rubbish')

In [ ]:
rubbish_model = tf.keras.models.load_model('rubbish')

In [ ]:
import nltk
import numpy as np
import pandas as pd
import tensorflow as tf

stopWordSet = nltk.corpus.stopwords.words('english')
stemmer = nltk.SnowballStemmer(language='english')
tokenizer = nltk.RegexpTokenizer(r"[a-zA-Z0-9]+")

def getTestData(inputfile):
    wordSense = 0
    lines = []
    senses = []

    for line in inputLines:
        if line == "1\n":
            wordSense = 1
        elif line == "2\n":
            wordSense = 2
        elif (line != "\n") & (wordSense != 0):
            lines.append(line.strip())
            senses.append(wordSense)
    trainDF = pd.DataFrame(data={'text': lines,'sense': senses})
    return trainDF

rubbishTestInput = open("testing/rubbish.txt", "r", encoding='utf-8')

lines = rubbishTestInput.readlines()
linesStripped = np.asarray([line.strip() for line in lines])

rubbish_predictions = rubbish_model.predict(linesStripped)
print(rubbish_predictions)

output_file = open('results/result_rubbish_Michael_Lennon.txt', "w", encoding='utf-8')

for prediction in rubbish_predictions:
    if prediction > 0.5:
        output_file.write('2\n')
    else:
        output_file.write('1\n')


# Rubbish Model.train()
rubbishTestInput.close()
output_file.close()